damrongsakspw/nrf52/Application_PMS/ble_central/ble_app_uart_c/main.c
#define NRF_BLE_SCAN_SCAN_INTERVAL_NORMAL         480
#define NRF_BLE_SCAN_SCAN_WINDOW_NORMAL           480

//#define NUS_SERVICE_UUID_TYPE   BLE_UUID_TYPE_BLE//BLE_UUID_TYPE_VENDOR_BEGIN              /**< UUID type for the Nordic UART Service (vendor specific). */

//#define ECHOBACK_BLE_UART_DATA  1                                       /**< Echo the UART data that is received over the Nordic UART Service (NUS) back to the sender. */


NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                             /**< Advertising module instance. */
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

BLE_ATAPY_DEF(m_atapy);
//BLE_NUS_C_DEF(m_ble_nus_c);                                             /**< BLE Nordic UART Service (NUS) client instance. */
//NRF_BLE_GATT_DEF(m_gatt);                                               /**< GATT module instance. */
//BLE_DB_DISCOVERY_DEF(m_db_disc);                                        /**< Database discovery module instance. */

NRF_BLE_SCAN_DEF(m_scan);                                               /**< Scanning Module instance. */
//NRF_QUEUE_DEF(char, m_queue, 1000, NRF_QUEUE_MODE_OVERFLOW);
NRF_QUEUE_DEF(char, m_queue, 870, NRF_QUEUE_MODE_OVERFLOW);
NRF_QUEUE_INTERFACE_DEC(char, my_queue);
NRF_QUEUE_INTERFACE_DEF(char, my_queue, &m_queue);
//char *ax[1000];
int round_evt = 0;
//uint8_t id[6];
//int num_id = 0;

 bool status_empty = false;

char data_ble[34];
char data_queue[29]; 
uint8_t * aux;
uint16_t aux_len ;    
uint8_t aux_array[100];

struct wifi_conf var_wifi;


struct status_scan chk_scan;

static ble_gap_scan_params_t const m_scan_param_slow =
{
    .interval      = NRF_BLE_SCAN_SCAN_INTERVAL_SLOW,
    .window        = NRF_BLE_SCAN_SCAN_WINDOW_SLOW

};

static ble_gap_scan_params_t const m_scan_param_normal =
{
    .interval      = NRF_BLE_SCAN_SCAN_INTERVAL_NORMAL,
    .window        = NRF_BLE_SCAN_SCAN_WINDOW_NORMAL

};

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] =                                               /**< Universally unique service identifiers. */
{
    {ATAPY_SERVICE_UUID, BLE_UUID_TYPE_VENDOR_BEGIN}
};

static ble_uuid_t const m_atapy_uuid =
{
  .uuid = 0xFEAA,//BLE_UUID_NUS_SERVICE,
  .type = BLE_UUID_TYPE_BLE//NUS_SERVICE_UUID_TYPE
};


static void advertising_start(bool erase_bonds);

//static struct status_scan chk_status_scan;


//queue_mesg uart_mesg;

//static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */


/**@brief Function for handling asserts in the SoftDevice.
*
* @details This function is called in case of an assert in the SoftDevice.
*
* @warning This handler is only an example and is not meant for the final product. You need to analyze
*          how your product is supposed to react in case of assert.
* @warning On assert from the SoftDevice, the system can only recover on reset.
*
* @param[in] line_num     Line number of the failing assert call.
* @param[in] p_file_name  File name of the failing assert call.
*/
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
  app_error_handler(0xDEADBEEF, line_num, p_file_name);
}


/**@brief Function for starting scanning. */
static void scan_start(void)
{
  ret_code_t ret;
  
  ret = nrf_ble_scan_start(&m_scan);
  APP_ERROR_CHECK(ret);
  
  ret = bsp_indication_set(BSP_INDICATE_SCANNING);
  APP_ERROR_CHECK(ret);
}


/**@brief Function for handling Scanning Module events.
*/
static void  scan_evt_handler(scan_evt_t const * p_scan_evt)
{
  
  //printf("scan_evt_handler: %d\r\n",p_scan_evt->scan_evt_id);
  switch(p_scan_evt->scan_evt_id)
  {
    //  ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
    //  
    //  const ble_gap_evt_adv_report_t * p_adv_report = &p_gap_evt->params.adv_report;
    //  
    //  uint8_t * aux = p_adv_report->data.p_data;
    //  uint16_t aux_len = p_adv_report->data.len;
    //  uint8_t aux_array[100];
    //  memcpy(aux_array,aux,aux_len);
    //char data_ble[29];
    

    
  case NRF_BLE_SCAN_EVT_NOT_FOUND:
    {
      //do something
      //printf("not found\r\n");
      
      
      /*printf("Received advertising from: %02x:%02x:%02x:%02x:%02x:%02x\n\r", p_scan_evt->params.p_not_found->peer_addr.addr[5], 
      p_scan_evt->params.p_not_found->peer_addr.addr[4], 
      p_scan_evt->params.p_not_found->peer_addr.addr[3], 
      p_scan_evt->params.p_not_found->peer_addr.addr[2], 
      p_scan_evt->params.p_not_found->peer_addr.addr[1], 
      p_scan_evt->params.p_not_found->peer_addr.addr[0]);
      
      */
      break;
    }

  case NRF_BLE_SCAN_EVT_FILTER_MATCH:
    {
      //printf("match\r\n");
      //char data_ble[29];
      //      uint8_t * aux = p_scan_evt->params.filter_match.p_adv_report->data.p_data;
      //      uint16_t aux_len = p_scan_evt->params.filter_match.p_adv_report->data.len;    
      //      uint8_t aux_array[100];[100];
      memset(aux_array,0,sizeof(aux_array));
      
      aux = p_scan_evt->params.filter_match.p_adv_report->data.p_data;
      aux_len = p_scan_evt->params.filter_match.p_adv_report->data.len;  
      
      memcpy(aux_array,aux,aux_len);
      
      if((aux_array[13] == 0x41) && (aux_array[14] == 0x50) && (aux_array[15] == 0x54)){
        memset(data_ble,0,sizeof(data_ble));
        /*printf("%02x:%02x:%02x:%02x:%02x:%02x\r\n",p_scan_evt->params.filter_match.p_adv_report->peer_addr.addr[5],
        p_scan_evt->params.filter_match.p_adv_report->peer_addr.addr[4],
        p_scan_evt->params.filter_match.p_adv_report->peer_addr.addr[3],
        p_scan_evt->params.filter_match.p_adv_report->peer_addr.addr[2],
        p_scan_evt->params.filter_match.p_adv_report->peer_addr.addr[1],
        p_scan_evt->params.filter_match.p_adv_report->peer_addr.addr[0]);
        */
        sprintf(data_ble,"%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02d",aux_array[16]                          //src_id
                                                                               ,aux_array[17]                          //src_id
                                                                               ,aux_array[18]                          //src_id    
                                                                               ,aux_array[19]                          //variance_0   
                                                                               ,aux_array[20]                          //variance_1   
                                                                               ,aux_array[21]                          //variance_2
                                                                               ,aux_array[23]                          //cnt
                                                                               ,aux_array[24]                          //vt_0
                                                                               ,aux_array[25]                          //vt_1
                                                                               ,aux_array[26]                          //vt_2
                                                                               ,aux_array[27]                          //activity    
                                                                               ,aux_array[28]                          //batt                                                                  
                                                                               ,p_scan_evt->params.filter_match.p_adv_report->rssi);    //rssi
        printf("data:%s\r\n",data_ble);
        
        //ret_code_t err_code = my_queue_write(data_ble, sizeof(data_ble));     
        //APP_ERROR_CHECK(err_code);
        round_evt++;
      }
      break;
    }    
  case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
    
    NRF_LOG_INFO("Scan timed out.");
    scan_start();
    break;
    
  default:
    break;
    
