damrongsakspw/nrf52/Application_PMS/ble_central/ble_app_uart_c/main.c
  }
}


/**@brief Function for initializing the scanning and setting the filters.
*/
static void scan_init(void)
{
  ret_code_t          err_code;
  nrf_ble_scan_init_t init_scan;
  
  memset(&init_scan, 0, sizeof(init_scan));
  
  init_scan.connect_if_match = false;
  init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;
  
  err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
  APP_ERROR_CHECK(err_code);
  
  err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_UUID_FILTER, &m_atapy_uuid);
  APP_ERROR_CHECK(err_code);
  
  err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_UUID_FILTER, false);
  APP_ERROR_CHECK(err_code);
  
}


/**@brief Function for handling database discovery events.
*
* @details This function is a callback function to handle events from the database discovery module.
*          Depending on the UUIDs that are discovered, this function forwards the events
*          to their respective services.
*
* @param[in] p_event  Pointer to the database discovery event.
*/
//static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
//{
//    ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
//}


/**@brief Function for handling characters received by the Nordic UART Service (NUS).
*
* @details This function takes a list of characters of length data_len and prints the characters out on UART.
*          If @ref ECHOBACK_BLE_UART_DATA is set, the data is sent back to sender.
*/


//static void ble_nus_chars_received_uart_print(uint8_t * p_data, uint16_t data_len)
//{
//    ret_code_t ret_val;
//
//    NRF_LOG_DEBUG("Receiving data.");
//    NRF_LOG_HEXDUMP_DEBUG(p_data, data_len);
//
//    for (uint32_t i = 0; i < data_len; i++)
//    {
//        do
//        {
//            ret_val = app_uart_put(p_data[i]);
//            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
//            {
//                //NRF_LOG_ERROR("app_uart_put failed for index 0x%04x.", i);
//                printf("app_uart_put failed for index 0x%04x.", i);
//                APP_ERROR_CHECK(ret_val);
//            }
//        } while (ret_val == NRF_ERROR_BUSY);
//    }
//    if (p_data[data_len-1] == '\r')
//    {
//        while (app_uart_put('\n') == NRF_ERROR_BUSY);
//    }
//    if (ECHOBACK_BLE_UART_DATA)
//    {
//        // Send data back to the peripheral.
//        do
//        {
//            ret_val = ble_nus_c_string_send(&
//, p_data, data_len);
//            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
//            {
//                NRF_LOG_ERROR("Failed sending NUS message. Error 0x%x. ", ret_val);
//                APP_ERROR_CHECK(ret_val);
//            }
//        } while (ret_val == NRF_ERROR_BUSY);
//    }
//}


/**@brief   Function for handling app_uart events.
*
* @details This function receives a single character from the app_uart module and appends it to
*          a string. The string is sent over BLE when the last character received is a
*          'new line' '\n' (hex 0x0A) or if the string reaches the maximum data length.
*/
void uart_event_handle(app_uart_evt_t * p_event)
{
  switch (p_event->evt_type)
  {
    
  case APP_UART_DATA_READY:
    {          
      
      uint8_t get;
      //uint8_t id[7];
      //int i = 0;
      //char ID;
      //printf("insert\r\n");
      if(app_uart_get(&get) == NRF_SUCCESS)
      {
        
        //printf("%d",get);
        //printf("%c",get);
        
        if ((get == 'A') || (get == 'a'))
        {
          //printf("insert\r\n");
          
          
          /*
          //int a = 5;
          uint8_t  *data;
          data = (uint8_t *) malloc(sizeof(uint8_t)*a);
          data[0] = 1;
          data[1] = 1;
          data[2] = 2;
          data[3] = 3;
          data[4] = 4;
          */  
          /*
          if(round_evt == 0){
          //do something
          //printf("round_evt :%d\r\n",round_evt);
          for (int a =0 ;a <= num_id; a++ ){
          //printf("%c num_id = %d\r\n",id[a],num_id);
        }
        }*/
          status_empty = my_queue_is_empty();
          if(status_empty != true)
            //if(round_evt > 0)
          {
            chk_scan.chk_round = true;
            //int size_data = 25*round_evt;
            //uint8_t  *dat;
            //dat = (uint8_t *) malloc(sizeof(uint8_t)*size_data);
            //char  *dat;
            //dat = (char *) malloc(sizeof(uint8_t)*size_data);        
            //printf("%d", nrf_queue_available_get(&m_queue));
            //int free_queue = nrf_queue_available_get(&m_queue);
            //int evt_queue = free_queue/25;
            //printf("%d:::::",evt_queue);
            
            
            printf("%d",round_evt);    
            for(uint8_t i=0;i<round_evt;i++){
              
              //char data_queue[29];   
              memset(data_queue,0,sizeof(data_queue));
              ret_code_t err_code = my_queue_read(data_queue, sizeof(data_queue));
              APP_ERROR_CHECK(err_code);
              printf(",%s",data_queue);  
              //printf(",%d",i);  
              //memset(data_queue, 0, sizeof(data_queue));
              
            }  
            printf(":\r\n");       
            round_evt = 0;
          }
          else
          {
            chk_scan.chk_round = false;
          }
        }
        else if((get == 'W') || (get == 'w'))
        {
          
          if((var_wifi.ssid_len != 0) && (var_wifi.user_len == 0) && (var_wifi.pass_len != 0))
          {
            for(uint8_t i =0;i<var_wifi.ssid_len+1;i++)printf("%c",var_wifi.ssid[i]);
            for(uint8_t i =0;i<var_wifi.pass_len+1;i++)printf("%c",var_wifi.pass[i]);
            
          }
          else if((var_wifi.ssid_len != NULL) && (var_wifi.user_len != NULL) &&(var_wifi.pass_len != NULL))
          {
            for(uint8_t i =0;i<var_wifi.ssid_len+1;i++)printf("%c",var_wifi.ssid[i]);          
            for(uint8_t i =0;i<var_wifi.user_len+1;i++)printf("%c",var_wifi.user[i]);
            for(uint8_t i =0;i<var_wifi.pass_len+1;i++)printf("%c",var_wifi.pass[i]);
          }
          else printf("request wifi\r\n"); 
        }     
      } 
      break;
    }
  default:
    break;
  }
}


/**@brief Callback handling Nordic UART Service (NUS) client events.
*
* @details This function is called to notify the application of NUS client events.
*
* @param[in]   p_ble_nus_c   NUS client handle. This identifies the NUS client.
* @param[in]   p_ble_nus_evt Pointer to the NUS client event.
*/

/**@snippet [Handling events from the ble_nus_c module] */

