damrongsakspw/nrf52/Application_PMS/ble_central/ble_app_uart_c/main.c
//static void ble_nus_c_evt_handler(ble_nus_c_t * p_ble_nus_c, ble_nus_c_evt_t const * p_ble_nus_evt)
//{
//    ret_code_t err_code;
//
//    switch (p_ble_nus_evt->evt_type)
//    {
//        case BLE_NUS_C_EVT_DISCOVERY_COMPLETE:
//            NRF_LOG_INFO("Discovery complete.");
//            err_code = ble_nus_c_handles_assign(p_ble_nus_c, p_ble_nus_evt->conn_handle, &p_ble_nus_evt->handles);
//            APP_ERROR_CHECK(err_code);
//
//            err_code = ble_nus_c_tx_notif_enable(p_ble_nus_c);
//            APP_ERROR_CHECK(err_code);
//            NRF_LOG_INFO("Connected to device with Nordic UART Service.");
//            break;
//
//        case BLE_NUS_C_EVT_NUS_TX_EVT:
//            ble_nus_chars_received_uart_print(p_ble_nus_evt->p_data, p_ble_nus_evt->data_len);
//            break;
//
//        case BLE_NUS_C_EVT_DISCONNECTED:
//            NRF_LOG_INFO("Disconnected.");
//            scan_start();
//            break;
//    }
//}
//
///**@snippet [Handling events from the ble_nus_c module] */
//
//
///**
// * @brief Function for handling shutdown events.
// *
// * @param[in]   event       Shutdown type.
// */
//static bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
//{
//    ret_code_t err_code;
//
//    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
//    APP_ERROR_CHECK(err_code);
//
//    switch (event)
//    {
//        case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
//            // Prepare wakeup buttons.
//            err_code = bsp_btn_ble_sleep_mode_prepare();
//            APP_ERROR_CHECK(err_code);
//            break;
//
//        default:
//            break;
//    }
//
//    return true;
//}

//NRF_PWR_MGMT_HANDLER_REGISTER(shutdown_handler, APP_SHUTDOWN_HANDLER_PRIORITY);


/**@brief Function for handling BLE events.
*
* @param[in]   p_ble_evt   Bluetooth stack event.
* @param[in]   p_context   Unused.
*/


static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context){
  ret_code_t  err_code = NRF_SUCCESS;
//  ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
//  
//  const ble_gap_evt_adv_report_t * p_adv_report = &p_gap_evt->params.adv_report;
//  
//  uint8_t * aux = p_adv_report->data.p_data;
//  uint16_t aux_len = p_adv_report->data.len;
//  uint8_t aux_array[100];
//  memcpy(aux_array,aux,aux_len);
//  char data_ble[29];
//  char des_id[7];
  
  //printf("ble_evt_handler: %d\r\n",p_ble_evt->header.evt_id);
  switch (p_ble_evt->header.evt_id)
  {
//      case BLE_GAP_EVT_ADV_REPORT:
//        {
//    
//          //       for(int i = 0;i<aux_len;i++){
//          //         printf("%02x",aux[i]);
//          //       }
//          //       printf("\r\n");
//    
//          //sprintf(des_id,"%x%x%x%x%x%x" ,aux_array[19] >> 4, aux_array[19] & 15, aux_array[20] >> 4, aux_array[20] & 15, aux_array[21] >> 4, aux_array[21] & 15);    
//          //if( ((aux_array[13] == 0x41) && (aux_array[14] == 0x50) && (des_id[0] == id[0] ) && (des_id[1] == id[1]) && (des_id[2] == id[2]) && (des_id[3] == id[3]) && (des_id[4] == id[4]) && (des_id[5] == id[5])) || ((aux_array[13] == 0x41) && (aux_array[14] == 0x50) && (aux_array[15] == 0x54) && (aux_array[19] == 0x00) && (aux_array[20] == 0x00) && (aux_array[21] == 0x00)) ){        
//           //if( ((aux_array[13] == 0x41) && (aux_array[14] == 0x50) && (aux_array[15] == 0x54) && (aux_array[16] != 0x00) && (aux_array[17] != 0x00) && (aux_array[18] != 0x00) && (aux_array[19] == 0x00) && (aux_array[20] == 0x00) && (aux_array[21] == 0x00)) || ((aux_array[13] == 0x41) && (aux_array[14] == 0x50) && (des_id[0] == id[0] ) && (des_id[1] == id[1]) && (des_id[2] == id[2]) && (des_id[3] == id[3]) && (des_id[4] == id[4]) && (des_id[5] == id[5])) ) {
//           //if( ((aux_array[13] == 0x41) && (aux_array[14] == 0x50) && (aux_array[15] == 0x54) && (aux_array[19] == 0x00) && (aux_array[20] == 0x00) && (aux_array[21] == 0x00)) || ((aux_array[13] == 0x41) && (aux_array[14] == 0x50) && (des_id[0] == id[0]) && (des_id[1] == id[1]) && (des_id[2] == id[2]) && (des_id[3] == id[3]) && (des_id[4] == id[4]) && (des_id[5] == id[5])) ) {
//           if((aux_array[13] == 0x41) && (aux_array[14] == 0x50) && (aux_array[15] == 0x54)){
//            //printf("des_id = %s\r\n",des_id);
//            //printf("id = %c%c%c%c%c%c \r\n",id[0],id[1],id[2],id[3],id[4],id[5]);
//             
//            /*         
//            
//            //NRF_LOG_RAW_INFO("RSSI2: %d\n", p_gap_evt->params.adv_report.rssi);
//            char data_ble[25];
//            sprintf(data_ble,"%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x",p_adv_report->peer_addr.addr[5]
//            ,p_adv_report->peer_addr.addr[4]
//            ,p_adv_report->peer_addr.addr[3]
//            ,p_adv_report->peer_addr.addr[2]
//            ,p_adv_report->peer_addr.addr[1]
//            ,p_adv_report->peer_addr.addr[0]
//            ,aux_array[23]
//            ,aux_array[24]
//            ,aux_array[25]
//            ,aux_array[26]
//            ,aux_array[27]    
//            ,aux_array[28]);
//             */
//            
//            //datacenter
//             /*
//             char data_ble[25];
//             sprintf(data_ble,"%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02d",aux_array[16]                          //src_id
//                                                                            ,aux_array[17]                          //src_id
//                                                                            ,aux_array[18]                          //src_id        
//                                                                            ,aux_array[23]                          //timestamp
//                                                                            ,aux_array[24]                          //timestamp
//                                                                            ,aux_array[25]                          //timestamp
//                                                                            ,aux_array[26]                          //cnt
//                                                                            ,aux_array[27]                          //activity    
//                                                                            ,aux_array[28]                          //batt
//                                                                            ,aux_array[15]                          //type
//                                                                              //,p_adv_report->rssi);
//                                                                            ,p_gap_evt->params.adv_report.rssi);    //rssi
//             */
//            
//             sprintf(data_ble,"%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02d",aux_array[16]                          //src_id
//                                                                                    ,aux_array[17]                          //src_id
//                                                                                    ,aux_array[18]                          //src_id    
//                                                                                    ,aux_array[19]                          //variance_0   
//                                                                                    ,aux_array[20]                          //variance_1   
//                                                                                    ,aux_array[21]                          //variance_2
//                                                                                    ,aux_array[23]                          //cnt
//                                                                                    ,aux_array[24]                          //vt_0
//                                                                                    ,aux_array[25]                          //vt_1
//                                                                                    ,aux_array[26]                          //vt_2
//                                                                                    ,aux_array[27]                          //activity    
//                                                                                    ,aux_array[28]                          //batt
//                                                                                    //p_adv_report->rssi);
//                                                                                    ,p_gap_evt->params.adv_report.rssi);    //rssi
//             
//             //printf("aux 23 : %02x \r\n",aux_array[23]);
//             //printf("%s\r\n",data_ble);
//             
//             ret_code_t err_code = my_queue_write(data_ble, sizeof(data_ble));     
//             APP_ERROR_CHECK(err_code);
//             //memset(data_ble,0,sizeof(data_ble));
//             round_evt++;
//             
//             //memset(data_ble, 0, sizeof(data_ble));     
//             //}
//           } 
//        }
//        break;
//    
  case BLE_GAP_EVT_DISCONNECTED:
    printf("Disconnected.\r\n");
    // LED indication will be changed when advertising starts.
    break;
    
  case BLE_GAP_EVT_CONNECTED:
    printf("Connected.\r\n");
    err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
    APP_ERROR_CHECK(err_code);
    m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
    err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
    APP_ERROR_CHECK(err_code);
    break;
    
