damrongsakspw/nrf52/Application_PMS/ble_central/ble_app_uart_c/main.c
    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        
        NRF_LOG_INFO("Start!");
        
        APP_ERROR_CHECK(err_code);
    }
}

void cus_timer_start(cus_timer_t timer, uint32_t ms)
{
  ret_code_t err_code;
  
  switch(timer)
  {    
    case CHK_SCAN_TIMER:
    {
      err_code = app_timer_start(m_chk_scan_id, TIMER_CHK_SCAN_INTERVAL, NULL);
      APP_ERROR_CHECK(err_code);
      break;
    }      
  default:
    break;
  }
}

/**@brief Function for starting default timers.
*/
void application_timers_start(void)
{
  cus_timer_start(CHK_SCAN_TIMER,NULL);    //start timer for reading sensor
}



/**@brief Function for stoping repeating timers.
*/
void cus_timer_stop(cus_timer_t timer)
{
  switch(timer)
  {
  case CHK_SCAN_TIMER:
    {
      app_timer_stop(m_chk_scan_id);
      break;
    }
  case ALL:
    {
      //app_timer_stop(m_chk_scan_id);
    }   
  default:
    break;
  }
}

void scan_timeout_handler(void * p_context)
{
  
  if(chk_scan.chk_round == false)
  {    
    chk_scan.cnt++;
    
    if (chk_scan.cnt >= SCAN_NOT_FOUND_10SEC)
    {
      
      if(chk_scan.flag_slow == false)
      {
        
        //chk_scan.flag_stop_scan = true;
        chk_scan.flag_slow = true;
        
        nrf_ble_scan_stop();          
        nrf_ble_scan_params_set(&m_scan,&m_scan_param_slow);
        scan_start();
        
      }   
    }
  }
  else
  {
    chk_scan.cnt = 0;
    
    if(chk_scan.flag_slow == true)
    {
      nrf_ble_scan_stop();          
      //scan_init();
      nrf_ble_scan_params_set(&m_scan,&m_scan_param_normal);
      scan_start();
   
      chk_scan.flag_slow  = false;
    }
  }
}


void timers_init(void)
{
  ret_code_t err_code = app_timer_init();
  APP_ERROR_CHECK(err_code);
  
  //timer for check empty scan
  err_code = app_timer_create(&m_chk_scan_id,
                              APP_TIMER_MODE_REPEATED,
                              scan_timeout_handler);
  APP_ERROR_CHECK(err_code); 
  
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated when button is pressed.
 */
static void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break; // BSP_EVENT_SLEEP

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break; // BSP_EVENT_DISCONNECT

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break; // BSP_EVENT_KEY_0

        default:
            break;
    }
}

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


 int main(void)
{
 
  bool erase_bonds;
  
  // Initialize.
  log_init();
  timers_init();
  uart_init();
  //buttons_leds_init();
  buttons_leds_init(&erase_bonds);
  //db_discovery_init();
  power_management_init();
  ble_stack_init();
  gap_params_init();
  gatt_init();
  services_init();
  advertising_init();
  conn_params_init();   
  peer_manager_init();
  scan_init();
  //nus_c_init();
  //application_timers_start();

  /* Start execution */
  //queue_clear(&uart_mesg);
  
  /*if((var_wifi.ssid_len == 0) || (var_wifi.pass_len == 0))
  {  
    advertising_start(erase_bonds); 
    while(true){
      if((var_wifi.ssid_len != 0) && (var_wifi.pass_len != 0)) break;
    }
    
  }*/
 
    scan_start();
    //application_timers_start();
  
  
  // Enter main loop.
  
  for (;;)
  {
    idle_state_handle();
  }
}